In [1]:
import pymysql

In [2]:
conn = pymysql.connect(
    host='localhost', 
    port=3306, 
    user='root', 
    passwd='toor', 
    db='news_db_team', 
    charset='utf8mb4'
)

In [3]:
import pandas as pd

In [4]:
df = pd.read_excel("test_news.xlsx")

In [5]:
cursor = conn.cursor()

# 테이블 생성

In [6]:
# articles
mk_platform_table = """
CREATE TABLE IF NOT EXISTS tbr_platform (
    id TINYINT UNSIGNED NOT NULL AUTO_INCREMENT,
    name VARCHAR(10) NULL,
    PRIMARY KEY (id)
)DEFAULT CHARSET=utf8mb4;
"""

데이터베이스도 바꿔줘야함

-- 데이터베이스의 문자셋 확인
SHOW VARIABLES LIKE 'character_set_database';

-- 데이터베이스 문자셋을 utf8mb4로 변경
ALTER DATABASE your_database_name CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci;

In [7]:
cursor.execute(mk_platform_table)
conn.commit()

In [8]:
df

   Unnamed: 0 title content author     publication_date            article_url
0           0   제목1     내용1   작성자1  2024-05-27 18:00:30  https://naver.com/123
1           1   제목2     내용2   작성자2  2024-05-27 18:10:30  https://naver.com/124
2           2   제목3     내용3   작성자3  2024-05-27 18:30:30  https://naver.com/125
3           3   제목4     내용5   작성자6  2024-05-27 18:40:30  https://naver.com/126

In [9]:
df = df.drop("Unnamed: 0", axis = 1)

In [10]:
df

  title content author     publication_date            article_url
0   제목1     내용1   작성자1  2024-05-27 18:00:30  https://naver.com/123
1   제목2     내용2   작성자2  2024-05-27 18:10:30  https://naver.com/124
2   제목3     내용3   작성자3  2024-05-27 18:30:30  https://naver.com/125
3   제목4     내용5   작성자6  2024-05-27 18:40:30  https://naver.com/126

In [11]:
sql = 'INSERT INTO NEWS (title, content, author, publication_date, article_url) VALUES (%s, %s, %s, %s, %s)'
for idx in range(len(df)):
    print(tuple(df.iloc[idx]))
    cursor.execute(sql, tuple(df.iloc[idx]))
conn.commit()

('제목1', '내용1', '작성자1', '2024-05-27 18:00:30', 'https://naver.com/123')
('제목2', '내용2', '작성자2', '2024-05-27 18:10:30', 'https://naver.com/124')
('제목3', '내용3', '작성자3', '2024-05-27 18:30:30', 'https://naver.com/125')
('제목4', '내용5', '작성자6', '2024-05-27 18:40:30', 'https://naver.com/126')

In [12]:
#categories
mk_categories_table = """
CREATE TABLE IF NOT EXISTS CATEGORIES (
    id INT UNSIGNED NOT NULL AUTO_INCREMENT,
    category_name VARCHAR(8) NOT NULL,
    PRIMARY KEY (id)
)DEFAULT CHARSET=utf8;
"""

In [13]:
cursor.execute(mk_categories_table)
conn.commit()

In [14]:
# publisher
mk_publisher_table = """
CREATE TABLE IF NOT EXISTS publisher (
    id INT UNSIGNED NOT NULL AUTO_INCREMENT,
    pub_name VARCHAR(8) NOT NULL,
    PRIMARY KEY (id)
)DEFAULT CHARSET=utf8;
"""

In [15]:
cursor.execute(mk_publisher_table)
conn.commit()

In [16]:
# platform
mk_platform_table = """
CREATE TABLE IF NOT EXISTS platform (
    id INT UNSIGNED NOT NULL AUTO_INCREMENT,
    platform_name VARCHAR(8) NOT NULL,
    PRIMARY KEY (id)
)DEFAULT CHARSET=utf8;
"""

In [17]:
cursor.execute(mk_platform_table)
conn.commit()

In [18]:
# users
mk_users_table = """
CREATE TABLE IF NOT EXISTS users (
    id INT UNSIGNED NOT NULL AUTO_INCREMENT,
    user_code VARCHAR(8) NOT NULL,
    user_name VARCHAR(16) NOT NULL,
    PRIMARY KEY (id)
)DEFAULT CHARSET=utf8;
"""

In [19]:
cursor.execute(mk_users_table)
conn.commit()

In [20]:
# comment
mk_comment_table = """
CREATE TABLE IF NOT EXISTS comment (
    id INT UNSIGNED NOT NULL AUTO_INCREMENT,
    user_id INT UNSIGNED NOT NULL,
    comt LONGBLOB NOT NULL,
    date DATETIME NOT NULL,
    news_id INT UNSIGNED NOT NULL,
    PRIMARY KEY (id),
    FOREIGN KEY (user_id) REFERENCES users(id),
    FOREIGN KEY (news_id) REFERENCES news(news_id)
)DEFAULT CHARSET=utf8;
"""

In [21]:
cursor.execute(mk_comment_table)
conn.commit()

FOREIGN KEY (`자식테이블에서의 컬럼명`) REFERENCES `부모테이블` (`부모테이블에서의 컬럼명`);

In [ ]:
ALTER TABLE `articles`
ADD CONSTRAINT `FK_publisher(부모)_TO_articles(자식)_1`
FOREIGN KEY (`pub_id`) 
REFERENCES `publisher` (`id`);

# INSERT 함수

In [29]:
insert_news_data = """
INSERT INTO NEWS (title, content, author, publication_date, article_url) VALUES
(%s, %s, %s, %s, %s);
"""

In [33]:
news_data = [('제목5', '내용5',	'작성자5','2024-05-29 18:00:30', 'https://naver.com/854')]

In [35]:
cursor.executemany(insert_news_data, news_data)
conn.commit()

In [37]:
def insert_news_data(news_data) :
    insert_news_data = """INSERT INTO NEWS (title, content, author, publication_date, article_url) VALUES(%s, %s, %s, %s, %s);"""
    cursor.executemany(insert_news_data, news_data)
    conn.commit()

In [38]:
news_data_try = [('제목6', '내용6',	'작성자6','2024-05-29 18:00:30', 'https://naver.com/854')]

In [39]:
insert_news_data(news_data_try)

# SELECT 함수

In [50]:
sql_select = "SELECT title FROM NEWS"
cursor.execute(sql_select)
rows = cursor.fetchall()
for row in rows:
    print(row)

('제목1',)
('제목2',)
('제목3',)
('제목4',)
('제목5',)
('제목5',)
('제목6',)
('제목1',)
('제목2',)
('제목3',)
('제목4',)

In [53]:
def select_news(watch) :
    sql_select = f"SELECT {watch} FROM NEWS"
    cursor.execute(sql_select)
    rows = cursor.fetchall()
    for row in rows:
        print(row)

In [54]:
select_news('title')

('제목1',)
('제목2',)
('제목3',)
('제목4',)
('제목5',)
('제목5',)
('제목6',)
('제목1',)
('제목2',)
('제목3',)
('제목4',)